//: [Previous](@previous)

import Foundation

//Comments (주석)
//스스로 기록하거나 기억을 되살리기 위해, 실행되지 않는 문장을 코드에 포함시키려면 ‘주석 (comments)’ 을 사용합니다. 스위프트 컴파일러는 코드를 컴파일할 때 주석을 무시합니다.
//‘한-줄짜리 (single-line) 주석’ 은 ‘빗금 두 개 (two forward-slashes; //)’ 로 시작합니다

/* 이것도 주석이지만
 여러 줄에 걸쳐 작성됩니다 */

//스위프트의 ‘여러 줄짜리 주석’ 은 다른 ‘여러 줄짜리 주석’ 을 ‘중첩할 (nested)’ 수 있습니다. ‘중첩된 주석’ 을 작성하려면 ‘여러 줄짜리 주석 블럭’ 을 시작한 다음 첫 번째 블럭 내에서 두 번째 ‘여러 줄짜리 주석’ 을 시작합니다.
//그 다음에는 두 번째 블럭을 닫고, 이어서 첫 번째 블럭을 닫습니다:

/* 이것은 첫 번째 여러 줄짜리 주석의 시작입니다.
 /* 이것은 두 번째이자, 중첩된 여러 줄짜리 주석입니다. */
 이것은 첫 번째 여러 줄짜리 주석의 끝입니다. */
//: [Next](@next)
